export const data = {
    "id": "铁路车辆",
    "children": [
        {
            "id": "铁路车辆分类",
            "children": [
                {
                    "id": "按用途分类",
                    "children": [
                        {
                            "id": "客车",
                            "children": [
                                {"id": "硬座车"},
                                {"id": "软座车"},
                                {"id": "硬卧车"},
                                {"id": "软卧车"},
                                {"id": "双层车"},
                                {"id": "餐车"},
                                {"id": "行李车"}
                            ]
                        },
                        {
                            "id": "货车",
                            "children": [
                                {
                                    "id": "通用货车",
                                    "children": [
                                        {"id": "敞车"},
                                        {"id": "棚车"},
                                        {"id": "平车"},
                                        {"id": "冷藏车"},
                                        {"id": "罐车"}
                                    ]
                                },
                                {
                                    "id": "专用货车",
                                    "children": [
                                        {"id": "矿石车"},
                                        {"id": "水泥车"},
                                        {"id": "集装箱车"},
                                        {"id": "长大货物车"},
                                        {"id": "罐车"}
                                    ]
                                },
                                {
                                    "id": "特种用途车",
                                    "children": [
                                        {"id": "检衡车"},
                                        {"id": "救援车"},
                                        {"id": "除雪车"}
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "特种用途车",
                            "children": [
                                {"id": "邮政车"},
                                {"id": "空调发电车"},
                                {"id": "文教车"},
                                {"id": "卫生车"},
                                {"id": "医疗车"},
                                {"id": "公务车"}
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "按轴数分类",
            "children": [
                {"id": "四轴车"},
                {"id": "六轴车"},
                {"id": "多轴车"}
            ]
        },
        {
            "id": "按载重分类",
            "children": [
                {"id": "50吨"},
                {"id": "60吨"},
                {"id": "75吨"},
                {"id": "90吨"},
                {"id": ">90吨 等"}
            ]
        },
        {
            "id": "铁路车辆基本构造",
            "children": [
                {"id": "车体及内部设备"},
                {
                    "id": "走行部(转向架)",
                    "children": [
                        {"id": "轮对"},
                        {"id": "轴箱油润装置"},
                        {"id": "侧架、摇枕及弹簧减振装置"}
                    ]
                },
                {
                    "id": "车钩缓冲装置",
                    "children": [
                        {"id": "车钩"},
                        {"id": "缓冲器"}
                    ]
                },
                {
                    "id": "制动装置",
                    "children": [
                        {
                            "id": "空气制动机",
                            "children": [
                                {"id": "制动主管"},
                                {"id": "截断塞门"},
                                {"id": "远心集尘器"},
                                {"id": "三通阀"},
                                {"id": "副风缸"},
                                {"id": "制动缸"},
                                {"id": "降压风缸"},
                                {"id": "空重车调整装置"}
                            ]
                        },
                        {"id": "人力制动机"},
                        {"id": "基础制动装置"},
                        {
                            "id": "新型车辆制动技术",
                            "children": [
                                {"id": "盘形制动"},
                                {"id": "轨道电磁制动"}
                            ]
                        }
                    ]
                },
                {"id": "列尾装置"}
            ]
        },
        {
            "id": "车辆代码、标记和技术经济参数",
            "children": [
                {
                    "id": "车辆代码",
                    "children": [
                        {"id": "车种代码"},
                        {"id": "车型代码"},
                        {"id": "车号代码"}
                    ]
                },
                {
                    "id": "车辆标记",
                    "children": [
                        {"id": "运用标记"},
                        {"id": "产权标记"},
                        {"id": "检修标记"}
                    ]
                },
                {
                    "id": "车辆技术经济参数",
                    "children": [
                        {"id": "自重系数"},
                        {"id": "轴重"},
                        {"id": "单位容积"},
                        {"id": "每延米轨道载重"},
                        {"id": "构造速度"}
                    ]
                }
            ]
        },
        {
            "id": "车辆检测与维修",
            "children": [
                {
                    "id": "定期检修",
                    "children": [
                        {"id": "厂修"},
                        {"id": "段修"},
                        {"id": "辅修"},
                        {"id": "轴检"}
                    ]
                },
                {"id": "日常维修"},
                {
                    "id": "车辆运行安全防范预警系统—5T",
                    "children": [
                        {"id": "车辆轴温智能探测系统(THDS)"},
                        {"id": "车辆运行品质动态监测系统(TPDS)"},
                        {"id": "车辆滚动轴承故障轨边声学诊断系统(TADS)"},
                        {"id": "货车故障轨边图像监测系统(TFDS)"},
                        {"id": "客车运行安全监控系统(TCDS)"}
                    ]
                }
            ]
        }
    ]
}
